MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM370FYDFG/mcu.h
/**************************************************************************//**
 * @file     TMPM370.h
 * @brief    CMSIS Cortex-M3 Core Peripheral Access Layer Header File for the 
 *           Toshiba 'TMPM370' Device Series 
 * @version  V1.03
 * @date     14. June 2010
 *
 * @note
 * Copyright (C) 2010 ARM Limited. All rights reserved.
 *
 * @par
 * ARM Limited (ARM) is supplying this software for use with Cortex-M 
 * processor based microcontrollers.  This file can be freely distributed 
 * within development tools that are supporting such ARM based processors. 
 *
 * @par
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
 * CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 ******************************************************************************/

#ifndef __TMPM370_H__
#define __TMPM370_H__

#ifdef __cplusplus
 extern "C" {
#endif 

/** @addtogroup TMPM370_Definitions TMPM370 Definitions
  This file defines all structures and symbols for TMPM370:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
  @{
*/


/******************************************************************************/
/*                Processor and Core Peripherals                              */
/******************************************************************************/
/** @addtogroup TMPM370_CMSIS TMPM370 CMSIS Definitions
  Configuration of the Cortex-M3 Processor and Core Peripherals
  @{
*/

/*
 * ==========================================================================
 * ---------- Interrupt Number Definition -----------------------------------
 * ==========================================================================
 */

typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ***************************************************/
  NonMaskableInt_IRQn           = -14,             /*!< 2 Non Maskable Interrupt                  */
  MemoryManagement_IRQn         = -12,             /*!< 4 Cortex-M3 Memory Management Interrupt   */
  BusFault_IRQn                 = -11,             /*!< 5 Cortex-M3 Bus Fault Interrupt           */
  UsageFault_IRQn               = -10,             /*!< 6 Cortex-M3 Usage Fault Interrupt         */
  SVCall_IRQn                   =  -5,             /*!< 11 Cortex-M3 SV Call Interrupt            */
  DebugMonitor_IRQn             =  -4,             /*!< 12 Cortex-M3 Debug Monitor Interrupt      */
  PendSV_IRQn                   =  -2,             /*!< 14 Cortex-M3 Pend SV Interrupt            */
  SysTick_IRQn                  =  -1,             /*!< 15 Cortex-M3 System Tick Interrupt        */
                                            
/******  TMPM370 Specific Interrupt Numbers *******************************************************/
  INT0_IRQn                     =   0,             /*!< Interrupt Pin (PH0/AINA0/96pin)           */
  INT1_IRQn                     =   1,             /*!< Interrupt Pin (PH1/AINA1/95pin)           */
  INT2_IRQn                     =   2,             /*!< Interrupt Pin (PH2/AINA2/94pin)           */
  INT3_IRQn                     =   3,             /*!< Interrupt Pin (PA0/TB0IN/2pin)            */
  INT4_IRQn                     =   4,             /*!< Interrupt Pin (PA2/TB1IN/4pin)            */
  INT5_IRQn                     =   5,             /*!< Interrupt Pin (PE4/TB2IN/15pin)           */
  INTRX0_IRQn                   =   6,             /*!< Serial reception (channel.0)              */
  INTTX0_IRQn                   =   7,             /*!< Serial transmit (channel.0)               */
  INTRX1_IRQn                   =   8,             /*!< Serial reception (channel.1)              */
  INTTX1_IRQn                   =   9,             /*!< Serial transmit (channel.1)               */
  INTVCNA_IRQn                  =  10,             /*!< Vector Engine interrupt A                 */
  INTVCNB_IRQn                  =  11,             /*!< Vector Engine interrupt B                 */
  INTEMG0_IRQn                  =  12,             /*!< PMD0 EMG interrupt                        */
  INTEMG1_IRQn                  =  13,             /*!< PMD1 EMG interrupt                        */
  INTOVV0_IRQn                  =  14,             /*!< PMD0 OVV interrupt                        */
  INTOVV1_IRQn                  =  15,             /*!< PMD1 OVV interrupt                        */
  INTADAPDA_IRQn                =  16,             /*!< ADCA conv. triggered by PMD0 is finished  */
  INTADBPDA_IRQn                =  17,             /*!< ADCB conv. triggered by PMD0 is finished  */
  INTADAPDB_IRQn                =  18,             /*!< ADCA conv. triggered by PMD1 is finished  */
  INTADBPDB_IRQn                =  19,             /*!< ADCB conv. triggered by PMD1 is finished  */
  INTTB00_IRQn                  =  20,             /*!< 16bit TMRB0 compare match detection 0     */
  INTTB01_IRQn                  =  21,             /*!< 16bit TMRB0 compare match detection 1     */
  INTTB10_IRQn                  =  22,             /*!< 16bit TMRB1 compare match detection 0     */
  INTTB11_IRQn                  =  23,             /*!< 16bit TMRB1 compare match detection 1     */
  INTTB40_IRQn                  =  24,             /*!< 16bit TMRB4 compare match detection 0     */
  INTTB41_IRQn                  =  25,             /*!< 16bit TMRB4 compare match detection 1     */
  INTTB50_IRQn                  =  26,             /*!< 16bit TMRB5 compare match detection 0     */
  INTTB51_IRQn                  =  27,             /*!< 16bit TMRB5 compare match detection 1     */
  INTPMD0_IRQn                  =  28,             /*!< PMD0 PWM interrupt                        */
  INTPMD1_IRQn                  =  29,             /*!< PMD1 PWM interrupt                        */
  INTCAP00_IRQn                 =  30,             /*!< 16bit TMRB0 input capture 0               */
  INTCAP01_IRQn                 =  31,             /*!< 16bit TMRB0 input capture 1               */
  INTCAP10_IRQn                 =  32,             /*!< 16bit TMRB1 input capture 0               */
  INTCAP11_IRQn                 =  33,             /*!< 16bit TMRB1 input capture 1               */
  INTCAP40_IRQn                 =  34,             /*!< 16bit TMRB4 input capture 0               */
  INTCAP41_IRQn                 =  35,             /*!< 16bit TMRB4 input capture 1               */
  INTCAP50_IRQn                 =  36,             /*!< 16bit TMRB5 input capture 0               */
  INTCAP51_IRQn                 =  37,             /*!< 16bit TMRB5 input capture 1               */
  INT6_IRQn                     =  38,             /*!< Interrupt Pin (PE6/TB3IN/17pin)           */
  INT7_IRQn                     =  39,             /*!< Interrupt Pin (PE7/TB3OUT/18pin)          */
  INTRX2_IRQn                   =  40,             /*!< Serial reception (channel.2)              */
  INTTX2_IRQn                   =  41,             /*!< Serial transmit (channel.2)               */
  INTADACPA_IRQn                =  42,             /*!< ADA conv. monitoring function interrupt A */
  INTADBCPA_IRQn                =  43,             /*!< ADB conv. monitoring function interrupt A */
  INTADACPB_IRQn                =  44,             /*!< ADA conv. monitoring function interrupt B */
  INTADBCPB_IRQn                =  45,             /*!< ADB conv. monitoring function interrupt B */
  INTTB20_IRQn                  =  46,             /*!< 16bit TMRB2 compare match detection 0     */
  INTTB21_IRQn                  =  47,             /*!< 16bit TMRB2 compare match detection 1     */
  INTTB30_IRQn                  =  48,             /*!< 16bit TMRB3 compare match detection 0     */
  INTTB31_IRQn                  =  49,             /*!< 16bit TMRB3 compare match detection 1     */
  INTCAP20_IRQn                 =  50,             /*!< 16bit TMRB2 input capture 0               */
  INTCAP21_IRQn                 =  51,             /*!< 16bit TMRB2 input capture 1               */
  INTCAP30_IRQn                 =  52,             /*!< 16bit TMRB3 input capture 0               */
  INTCAP31_IRQn                 =  53,             /*!< 16bit TMRB3 input capture 1               */
  INTADASFT_IRQn                =  54,             /*!< ADCA conv. started by software finished   */
  INTADBSFT_IRQn                =  55,             /*!< ADCB conv. started by software finished   */
  INTADATMR_IRQn                =  56,             /*!< ADCA conv. triggered by timer finished    */
  INTADBTMR_IRQn                =  57,             /*!< ADCB conv. triggered by timer finished    */
  INT8_IRQn                     =  58,             /*!< Interrupt Pin (PA7/TB4IN/9pin)            */
  INT9_IRQn                     =  59,             /*!< Interrupt Pin (PD3/33pin)                 */
  INTA_IRQn                     =  60,             /*!< Interrupt Pin (FTEST2/PL1/21pin)          */
  INTB_IRQn                     =  61,             /*!< Interrupt Pin (FTEST3/PL0/20pin)          */
  INTENC0_IRQn                  =  62,             /*!< Ender input0 interrupt                    */
  INTENC1_IRQn                  =  63,             /*!< Ender input1 interrupt                    */
  INTRX3_IRQn                   =  64,             /*!< Serial reception (channel.3)              */
  INTTX3_IRQn                   =  65,             /*!< Serial transmit (channel.3)               */
  INTTB60_IRQn                  =  66,             /*!< 16bit TMRB6 compare match detection 0     */
  INTTB61_IRQn                  =  67,             /*!< 16bit TMRB6 compare match detection 1     */
  INTTB70_IRQn                  =  68,             /*!< 16bit TMRB7 compare match detection 0     */
  INTTB71_IRQn                  =  69,             /*!< 16bit TMRB7 compare match detection 1     */
  INTCAP60_IRQn                 =  70,             /*!< 16bit TMRB6 input capture 0               */
  INTCAP61_IRQn                 =  71,             /*!< 16bit TMRB6 input capture 1               */
  INTCAP70_IRQn                 =  72,             /*!< 16bit TMRB7 input capture 0               */
  INTCAP71_IRQn                 =  73,             /*!< 16bit TMRB7 input capture 1               */
  INTC_IRQn                     =  74,             /*!< Interrupt Pin (PJ6/AINB9/74pin)           */
  INTD_IRQn                     =  75,             /*!< Interrupt Pin (PJ7/AINB10/73pin)          */
  INTE_IRQn                     =  76,             /*!< Interrupt Pin (PK0/AINB11/72pin)          */
  INTF_IRQn                     =  77,             /*!< Interrupt Pin (PK1/AINB12/71pin)          */
} IRQn_Type;                                   
                                               
