MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM370FYDFG/mcu.h
/*                                      
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the Cortex-M3 Processor and Core Peripherals */
#define __MPU_PRESENT             0         /*!< MPU present or not                           */
#define __NVIC_PRIO_BITS          8         /*!< Number of Bits used for Priority Levels      */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used */

/*@}*/ /* end of group TMPM370_CMSIS */

#include "core_cm3.h"                       /* Cortex-M3 processor and core peripherals            */
// Note: Changed for MikroE implementation.
// #include "system_TMPM370.h"                 /* TMPM360 System                                      */



/******************************************************************************/
/*                Device Specific Peripheral registers structures             */
/******************************************************************************/
/** @addtogroup TMPM370_Peripherals TMPM370 Peripherals
  TMPM370 Device Specific Peripheral registers structures
  @{
*/

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/*------------- General Purpose Input/Output Port (PORT) ---------------------*/
/** @addtogroup TMPM370_PORT TMPM370 General Purpose Input/Output Port (PORT)
  @{
*/
typedef struct
{
  __IO uint32_t DATA;               /*!< Offset: 0x0000   Port Data Register */
  __IO uint32_t CR;                 /*!< Offset: 0x0004   Port Control Register */
  __IO uint32_t FR1;                /*!< Offset: 0x0008   Port Function Register 1 */
  __IO uint32_t FR2;                /*!< Offset: 0x000C   Port Function Register 2 */
  __IO uint32_t FR3;                /*!< Offset: 0x0010   Port Function Register 3 */
       uint32_t RESERVED0[5];
  __IO uint32_t OD;                 /*!< Offset: 0x0028   Port Open drain control Register */
  __IO uint32_t PUP;                /*!< Offset: 0x002C   Port Pull up control Register */
  __IO uint32_t PDN;                /*!< Offset: 0x003C   Port Pull down control register */
       uint32_t RESERVED1;
  __IO uint32_t IE;                 /*!< Offset: 0x0038   Port Input control enable Register */
} TSB_PORT_TypeDef;
/*@}*/ /* end of group TMPM370_PORT */

/*------------- 16-bit Timer/Event Counter (TMRB) ----------------------------*/
/** @addtogroup TMPM370_TMRB TMPM370 16-bit Timer/Event Counter (TMRB)
  @{
*/
typedef struct
{
  __IO uint32_t EN;                 /*!< Offset: 0x0000   Timer Enable Register */               
  __IO uint32_t RUN;                /*!< Offset: 0x0004   Timer RUN Register */
  __IO uint32_t CR;                 /*!< Offset: 0x0008   Timer Control Register */
  __IO uint32_t MOD;                /*!< Offset: 0x000C   Timer Mode Register */
  __IO uint32_t FFCR;               /*!< Offset: 0x0010   Timer Flip-Flop Control Register */
  __IO uint32_t ST;                 /*!< Offset: 0x0014   Timer Status Register */
  __IO uint32_t IM;                 /*!< Offset: 0x0018   Interrupt Mask Register */
  __IO uint32_t UC;                 /*!< Offset: 0x001C   Timer Up Counter Register */
  __IO uint32_t RG0;                /*!< Offset: 0x0020   Timer Register 0 */
  __IO uint32_t RG1;                /*!< Offset: 0x0024   Timer Register 1 */
  __IO uint32_t CP0;                /*!< Offset: 0x0028   Capture register 0 */
  __IO uint32_t CP1;                /*!< Offset: 0x002C   Capture register 1 */
} TSB_TMRB_TypeDef;
/*@}*/ /* end of group TMPM370_TMRB */

/*------------- Encoder input (ENC) ------------------------------------------*/
/** @addtogroup TMPM370_ENC TMPM370 Encoder input (ENC)
  @{
*/
typedef struct
{
  __IO uint32_t TNCR;               /*!< Offset: 0x0000   Encoder Input Control Register */               
  __IO uint32_t RELOAD;             /*!< Offset: 0x0004   Encoder Counter Reload Register */
  __IO uint32_t INT;                /*!< Offset: 0x0008   Encoder Compare Register  */
  __IO uint32_t CNT;                /*!< Offset: 0x000C   Encoder Counter */
} TSB_ENC_TypeDef;
/*@}*/ /* end of group TMPM370_ENC */

/*------------- General-purpose Serial Interface (SIO/UART) ------------------*/
/** @addtogroup TMPM370_SIO_UART TMPM370 General-purpose Serial Interface (SIO/UART)
  @{
*/
typedef struct
{
  __IO uint32_t EN;                 /*!< Offset: 0x0000   SIO Enable Register */
  __IO uint32_t BUF;                /*!< Offset: 0x0004   SIO Transmit/ Receive Buffer Register */
  __IO uint32_t CR;                 /*!< Offset: 0x0008   SIO Control Register */
  __IO uint32_t MOD0;               /*!< Offset: 0x000C   SIO Mode Control Register 0 */
  __IO uint32_t BRCR;               /*!< Offset: 0x0010   SIO Baud Rate Generator Control */
  __IO uint32_t BRADD;              /*!< Offset: 0x0014   SIO Baud rate Generator Control 2 */
  __IO uint32_t MOD1;               /*!< Offset: 0x0018   SIO Mode Control Register 1 */
  __IO uint32_t MOD2;               /*!< Offset: 0x001C   SIO Mode Control Register 2 */
  __IO uint32_t RFC;                /*!< Offset: 0x0020   SIO Receive FIFO Configuration Register */
  __IO uint32_t TFC;                /*!< Offset: 0x0024   SIO Transmit FIFO Configuration Register */
  __I  uint32_t RST;                /*!< Offset: 0x0028   SIO Receive FIFO Status Register */
  __I  uint32_t TST;                /*!< Offset: 0x002C   SIO Transmit FIFO Status Register */
  __IO uint8_t  FCNF;               /*!< Offset: 0x0030   SIO FIFO Configuration Register */
} TSB_SIO_TypeDef;
/*@}*/ /* end of group TMPM370_SIO_UART */

/*------------- 12-bit A/D Converter (A/DC) ----------------------------------*/
/** @addtogroup TMPM370_ADC TMPM370 12-bit A/D Converter (A/DC)
  @{
*/
typedef struct
{
  __IO uint32_t CLK;                /*!< Offset: 0x0000   ADC Clock Setting Register */
  __IO uint32_t MOD0;               /*!< Offset: 0x0004   ADC Mode Setting Register 0 */
  __IO uint32_t MOD1;               /*!< Offset: 0x0008   ADC Mode Setting Register 1 */
  __IO uint32_t MOD2;               /*!< Offset: 0x000C   ADC Mode Setting Register 2 */
  __IO uint32_t CMPCR0;             /*!< Offset: 0x0010   ADC Monitoring Setting Register 0 */
  __IO uint32_t CMPCR1;             /*!< Offset: 0x0014   ADC Monitoring Setting Register 1 */
  __IO uint32_t CMP0;               /*!< Offset: 0x0018   AD Conversion Result Compare Register 0 */
  __IO uint32_t CMP1;               /*!< Offset: 0x001C   AD Conversion Result Compare Register 1 */
  __IO uint32_t REG[12];            /*!< Offset: 0x0020   AD Conversion Result Register 0.11 */
  __IO uint32_t PSEL[12];           /*!< Offset: 0x0050   PMD Trigger Program Number Select Register 0..11 */
  __IO uint32_t PINTS[6];           /*!< Offset  0x0080   PMD Trigger Interrupt Select Register 0..5 */
  __IO uint32_t PSET[6];            /*!< Offset  0x0098   PMD Trigger Program Register 0..5 */
  __IO uint8_t  TSET[12];           /*!< Offset  0x00B0   Timer Trigger Program Registers 0..11 */
  __IO uint8_t  SSET[12];           /*!< Offset  0x00BC   Software Program Registers 0..1 */
  __IO uint8_t  ASET[12];           /*!< Offset  0x00C8   Constant Conversion Program Registers 0..12 */
  __IO uint32_t HWCR;               /*!< Offset  0x00D4   Hard Macro Control Register */
} TSB_ADC_TypeDef;
/*@}*/ /* end of group TMPM370_ADC */

/*------------- Op-Amps/Analog Converter (AMP/CMP) ---------------------------*/
/** @addtogroup TMPM370_AMP_CMP TMPM370 Op-Amps/Analog Converter (AMP/CMP)
  @{
*/
typedef struct
{
  __IO uint32_t AMPCTLA;            /*!< Offset: 0x0000   Amp A Control Register */ 
       uint32_t RESERVED0;
  __IO uint32_t AMPCTLB;            /*!< Offset: 0x0008   Amp B Control Register */ 
       uint32_t RESERVED1;
  __IO uint32_t AMPCTLC;            /*!< Offset: 0x0010   Amp C Control Register */ 
       uint32_t RESERVED2;
  __IO uint32_t AMPCTLD;            /*!< Offset: 0x0018   Amp D Control Register */ 
       uint32_t RESERVED3;
  __IO uint32_t CMPCTLA;            /*!< Offset: 0x0020   Comparator A Control Register */ 
       uint32_t RESERVED4;
  __IO uint32_t CMPCTLB;            /*!< Offset: 0x0028   Comparator B Control Register */ 
       uint32_t RESERVED5;
  __IO uint32_t CMPCTLC;            /*!< Offset: 0x0030   Comparator C Control Register */ 
       uint32_t RESERVED6;
  __IO uint32_t CMPCTLD;            /*!< Offset: 0x0038   Comparator D Control Register */ 
} TSB_AMPCMP_TypeDef;
/*@}*/ /* end of group TMPM370_AMP_CMP */

/*------------- Watchdog Timer (WDT) -----------------------------------------*/
/** @addtogroup TMPM370_WDT TMPM370 Watchdog Timer (WDT)
  @{
*/
typedef struct
{
  __IO uint32_t MOD;                /*!< Offset: 0x0000   WDT Mode Register */
  __IO uint32_t CR;                 /*!< Offset: 0x0004   WDT Control Register */
} TSB_WDT_TypeDef;
/*@}*/ /* end of group TMPM370_WDT */

