MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM370FYDFG/mcu.h
/*------------- Clock Generator (CG) -----------------------------------------*/
/** @addtogroup TMPM370_CG TMPM370 Clock Generator (CG)
  @{
*/
typedef struct
{
  __IO uint32_t SYSCR;              /*!< Offset: 0x0000   System Control Register */
  __IO uint32_t OSCCR;              /*!< Offset: 0x0004   Oscillation Control Register */
  __IO uint32_t STBYCR;             /*!< Offset: 0x0008   Standby Control Register */
  __IO uint32_t PLLSEL;             /*!< Offset: 0x000C   PLL Selection Register */
  __IO uint32_t CKSEL;              /*!< Offset: 0x0010   System Clock Selection Register */
  __IO uint32_t ICRCG;              /*!< Offset: 0x0014   CG Interrupt Request Clear Register (wr) */
  __IO uint32_t NMIFLG;             /*!< Offset: 0x0018   NMI Flag Register (rd) */
  __IO uint32_t RSTFLG;             /*!< Offset: 0x001C   Reset Flag Register */
  __IO uint32_t IMCGA;              /*!< Offset: 0x0020   CG Interrupt Mode Control Register A */
  __IO uint32_t IMCGB;              /*!< Offset: 0x0024   CG Interrupt Mode Control Register B */
  __IO uint32_t IMCGC;              /*!< Offset: 0x0028   CG Interrupt Mode Control Register C */
  __IO uint32_t IMCGD;              /*!< Offset: 0x002C   CG Interrupt Mode Control Register D */
  __IO uint32_t IMCGE;              /*!< Offset: 0x0030   CG Interrupt Mode Control Register E */
  __IO uint32_t IMCGF;              /*!< Offset: 0x0034   CG Interrupt Mode Control Register F */
  __IO uint32_t IMCGG;              /*!< Offset: 0x0038   CG Interrupt Mode Control Register G */
  __IO uint32_t IMCGH;              /*!< Offset: 0x003C   CG Interrupt Mode Control Register H */
} TSB_CG_TypeDef;
/*@}*/ /* end of group TMPM370_CG */

/*------------- Oscillation frequency detector (OFD) -------------------------*/
/** @addtogroup TMPM370_OFD TMPM370 Oscillation frequency detector (OFD)
  @{
*/
typedef struct
{
  __IO uint32_t CLKSCR1;            /*!< Offset: 0x0000   Oscillation frequency detection control register 1 */
  __IO uint32_t CLKSCR2;            /*!< Offset: 0x0004   Oscillation frequency detection control register 2 */
  __IO uint32_t CLKSMINPLLOFF;      /*!< Offset: 0x0008   Lower detection frequency setting register (In case of PLL OFF) */
  __IO uint32_t CLKSMINPLLON;       /*!< Offset: 0x000C   Lower detection frequency setting register (In case of PLL ON) */
  __IO uint32_t CLKSMXPLLOFF;       /*!< Offset: 0x0010   Higher detection frequency setting register (In case of PLL OFF) */
  __IO uint32_t CLKSMXPLLON;        /*!< Offset: 0x0014   Higher detection frequency setting register (In case of PLL ON) */
} TSB_OFD_TypeDef;
/*@}*/ /* end of group TMPM370_OFD */

/*------------- Power on reset / Voltage detecting circuit (POR/VLTD) --------*/
/** @addtogroup TMPM370_POR_VLTD TMPM370 Power on reset / Voltage detecting circuit (POR/VLTD)
  @{
*/
typedef struct
{
  __I  uint32_t CR;                 /*!< Offset: 0x0000   Voltage detection control register */
  __I  uint32_t SR;                 /*!< Offset: 0x0004   Voltage detection status register */
} TSB_VD_TypeDef;
/*@}*/ /* end of group TMPM370_POR_VLTD */

/*------------- Vector Engine (VE) -------------------------------------------*/
/** @addtogroup TMPM370_VE TMPM370 Vector Engine (VE)
  @{
*/
typedef struct
{
  __IO uint32_t MCTLF;              /*!< Low-speed flag */
  __IO uint32_t MODE;               /*!< Task control mode */
  __IO uint32_t FMODE;              /*!< Flow control */
  __IO uint32_t TPWM;               /*!< PWM period rate (PWM period [s]  maximum speed  2^16) */
  __IO uint32_t OMEGA;              /*!< Rotation speed (speed [Hz] maximum speed  2^15) */
  __IO uint32_t THETA;              /*!< Motor phase (motor phase [deg]/360  2^16) */
  __IO uint32_t ID_REF;             /*!< d-axis reference value (current [A]  maximum current  2^15) */
  __IO uint32_t IQ_REF;             /*!< q-axis reference value (current [A]  maximum current  2^15) */
  __IO uint32_t VD;                 /*!< d-axis voltage (voltage [V]  maximum voltage  2^31) */
  __IO uint32_t VQ;                 /*!< q-axis voltage (voltage [V]  maximum voltage  2^31) */
  __IO uint32_t CID_KI;             /*!< Integral coefficient for PI control of d-axis */
  __IO uint32_t CID_KP;             /*!< Proportional coefficient for PI control of d-axis */
  __IO uint32_t CIQ_KI;             /*!< Integral coefficient for PI control of q-axis */
  __IO uint32_t CIQ_KP;             /*!< Proportional coefficient for PI control of q-axis */
  __IO uint32_t VD_IH;              /*!< Upper 32 bits of integral term (VD_I ) of d-axis voltage */
  __IO uint32_t VD_ILH;             /*!< Lower 32 bits of integral term (VD_I) of d-axis voltage */
  __IO uint32_t VQ_IH;              /*!< Upper 32 bits of integral term (VQ_I) of q-axis voltage */
  __IO uint32_t VQ_ILH;             /*!< Lower 32 bits of integral term (VQ_I) of q-axis voltage */
  __IO uint32_t F_PWMCHG;           /*!< Switching speed (for 2-phase modulation and shift PWM) */
  __IO uint32_t MDPRD;              /*!< PWM period (to be set identically with PMDs PWM period) */
  __IO uint32_t MINPLS;             /*!< Minimum pulse width */
  __IO uint32_t TRGCRC;             /*!< Synchronizing trigger correction value */
  __IO uint32_t VDC_L;              /*!< DC supply voltage effective value (minimum input) */
  __IO uint32_t COS;                /*!< Cosine value at THETA for output conversion (Q15 data) */
  __IO uint32_t SIN;                /*!< Sine value at THETA for output conversion (Q15 data) */
  __IO uint32_t COSM;               /*!< Previous cosine value for input processing (Q15 data) */
  __IO uint32_t SINM;               /*!< Previous sine value for input processing (Q15 data) */
  __IO uint32_t SECTOR;             /*!< Sector information (0-11)  */
  __IO uint32_t SECTORM;            /*!< Previous sector information for input processing (0-11) */
  __IO uint32_t IAO;                /*!< AD conversion result of a-phase zero-current */
  __IO uint32_t IBO;                /*!< AD conversion result of b-phase zero-current */
  __IO uint32_t ICO;                /*!< AD conversion result of c-phase zero-current */
  __IO uint32_t IA_ADC;             /*!< AD conversion result of a-phase current */
  __IO uint32_t IB_ADC;             /*!< AD conversion result of b-phase current */
  __IO uint32_t IC_ADC;             /*!< AD conversion result of c-phase current */
  __IO uint32_t VDC;                /*!< DC supply voltage (voltage [V]  maximum voltage  2^15) */
  __IO uint32_t ID;                 /*!< d-axis current (current [A]  maximum current  2^31) */
  __IO uint32_t IQ;                 /*!< q-axis current (current [A]  maximum current  2^31) */
} TSB_VE_Channel_TypeDef;

typedef struct
{
  __IO uint32_t CMPU;               /*!< PMD control: CMPU setting */
  __IO uint32_t CMPV;               /*!< PMD control: CMPV setting */
  __IO uint32_t CMPW;               /*!< PMD control: CMPW setting */
  __IO uint32_t OUTCR;              /*!< PMD control: Output control (MDOUT) */
  __IO uint32_t TRGCMP0;            /*!< PMD control: TRGCMP0 setting */
  __IO uint32_t TRGCMP1;            /*!< PMD control: TRGCMP1 setting */
  __IO uint32_t TRGSEL;             /*!< PMD control: Trigger selection */
  __IO uint32_t EMGRS;              /*!< PMD control: EMG return (EMGCR[EMGRS]) */
} TSB_VE_ChannelControl_TypeDef;

typedef struct
{
  __IO uint32_t VEEN;               /*!< Offset: 0x0000   VE enable/disable */
  __O  uint32_t CPURUNTRG;          /*!< Offset: 0x0004   CPU start trigger selection */
  __IO uint32_t TASKAPP;            /*!< Offset: 0x0008   Task selection */
  __IO uint32_t ACTSCH;             /*!< Offset: 0x000C   Operation schedule selection */
  __IO uint32_t REPTIME;            /*!< Offset: 0x0010   Schedule repeat count */
  __IO uint32_t TRGMODE;            /*!< Offset: 0x0014   Start trigger mode */
  __IO uint32_t ERRINTEN;           /*!< Offset: 0x0018   Error interrupt enable/disable */
  __O  uint32_t COMPEND;            /*!< Offset: 0x001C   VE forced termination */
  __I  uint32_t ERRDET;             /*!< Offset: 0x0020   Error detection */
  __I  uint32_t SCHTASKRUN;         /*!< Offset: 0x0024   Schedule executing flag/executing task */
       uint32_t RESERVED0;
  __IO uint32_t TMPREG[6];          /*!< Offset: 0x002C   Temporary register 0..5 */
  TSB_VE_Channel_TypeDef CHN[2];   /*!< Offset: 0x0044   Channel  Register */
  __IO uint32_t MMODE;              /*!< Offset: 0x0174   Monitor control Register */
  __IO uint32_t TADC;               /*!< Offset: 0x0178   ADC conversion time (based on PWM clock)  Register */
  TSB_VE_ChannelControl_TypeDef CHN_CTRL[2]; /*!< Offset: 0x017C   Channel Control Register */
} TSB_VE_TypeDef;
/*@}*/ /* end of group TMPM370_VE */

/*------------- Programmable motor driver (PMD) -------------------------------*/
/** @addtogroup TMPM370_PMD TMPM370 Programmable motor driver (PMD)
  @{
*/
typedef struct
{
  __IO uint32_t MDEN;               /*!< Offset: 0x0000   PMD Enable Register (MDEN) */
  __IO uint32_t PORTMD;             /*!< Offset: 0x0004   Port Output Mode Register (PORTMD) */
  __IO uint32_t MDCR;               /*!< Offset: 0x0008   PMD Control Register (MDCR) */
  __IO uint32_t CNTSTA;             /*!< Offset: 0x000C   PWM Counter Status Register (CNTSTA) */
  __IO uint32_t MDCNT;              /*!< Offset: 0x0010   PWM Counter Register (MDCNT) */
  __IO uint32_t MDPRD;              /*!< Offset: 0x0014   PWM Period Register (MDPRD) */
  __IO uint32_t CMPU;               /*!< Offset: 0x0018   PWM Compare Registers (CMPU) */
  __IO uint32_t CMPV;               /*!< Offset: 0x001C   PWM Compare Registers (CMPV) */
  __IO uint32_t CMPW;               /*!< Offset: 0x0020   PWM Compare Registers (CMPW) */
  __IO uint32_t MODESEL;            /*!< Offset: 0x0024   Mode Select Register (MODESEL) */
  __IO uint32_t MDOUT;              /*!< Offset: 0x0028   PMD Output Control Register (MDOUT) */
  __IO uint32_t MDPOT;              /*!< Offset: 0x002C   PMD Output Setting Register (MDPOT) */
  __IO uint32_t EMGREL;             /*!< Offset: 0x0030   EMG Release Register (EMGREL) */
  __IO uint32_t EMGCR;              /*!< Offset: 0x0034   EMG Control Register (EMGCR) */
  __IO uint32_t EMGSTA;             /*!< Offset: 0x0038   EMG Status Register (EMGSTA) */
  __IO uint32_t OVVCR;              /*!< Offset: 0x003C   OVV Control Register (OVVCR) */
  __IO uint32_t OVVSTA;             /*!< Offset: 0x0040   OVV Status Register (OVVSTA) */
  __IO uint32_t DTR;                /*!< Offset: 0x0044   Dead Time Register (DTR) */
  __IO uint32_t TRGCMP[4];          /*!< Offset: 0x0048   Trigger Compare Registers (TRGCMP0..3) */
  __IO uint32_t TRGCR;              /*!< Offset: 0x0058   Trigger Control Register (TRGCR) */
  __IO uint32_t TRGCMD;             /*!< Offset: 0x005C   Trigger Output Mode Setting Register (TRGMD) */
  __IO uint32_t TRGSEL;             /*!< Offset: 0x0060   Trigger Output Select Register (TRGSEL) */
} TSB_PMD_TypeDef;
/*@}*/ /* end of group TMPM370_PMD */

