MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM370FYDFG/mcu.h
/*------------- Flash Control (FC) -------------------------------------------*/
/** @addtogroup TMPM370_FC TMPM370 Flash Control (FC)
  @{
*/
typedef struct
{
       uint32_t RESERVED0[4];
  __IO uint32_t SECBIT;             /*!< Offset: 0x0010   Security Bit Register */
       uint32_t RESERVED1[3];
  __I  uint32_t FLCS;               /*!< Offset: 0x0020   Flash Control Register */
} TSB_FC_TypeDef;
/*@}*/ /* end of group TMPM370_FC */

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/*@}*/ /* end of group TMPM370_Peripherals */


/******************************************************************************/
/*                              Memory Mapping                                */
/******************************************************************************/
/** @addtogroup TMPM370_MemoryMap TMPM370 Memory Mapping
  @{
*/

#define TSB_FLASH_BASE       (0x00000000UL)                  /*!< (FLASH     ) Base Address */
#define TSB_RAM_BASE         (0x20000000UL)                  /*!< (RAM       ) Base Address */
#define TSB_PERI_BASE        (0x40000000UL)                  /*!< (Peripheral) Base Address */

#define TSB_PA_BASE          (TSB_PERI_BASE  + 0x00000000)  /*!< (PA        ) Base Address */
#define TSB_PB_BASE          (TSB_PERI_BASE  + 0x00000040)  /*!< (PB        ) Base Address */
#define TSB_PC_BASE          (TSB_PERI_BASE  + 0x00000080)  /*!< (PC        ) Base Address */
#define TSB_PD_BASE          (TSB_PERI_BASE  + 0x000000C0)  /*!< (PD        ) Base Address */
#define TSB_PE_BASE          (TSB_PERI_BASE  + 0x00000100)  /*!< (PE        ) Base Address */
#define TSB_PF_BASE          (TSB_PERI_BASE  + 0x00000140)  /*!< (PF        ) Base Address */
#define TSB_PG_BASE          (TSB_PERI_BASE  + 0x00000180)  /*!< (PG        ) Base Address */
#define TSB_PH_BASE          (TSB_PERI_BASE  + 0x000001C0)  /*!< (PH        ) Base Address */
#define TSB_PI_BASE          (TSB_PERI_BASE  + 0x00000200)  /*!< (PI        ) Base Address */
#define TSB_PJ_BASE          (TSB_PERI_BASE  + 0x00000240)  /*!< (PJ        ) Base Address */
#define TSB_PK_BASE          (TSB_PERI_BASE  + 0x00000280)  /*!< (PK        ) Base Address */
#define TSB_PL_BASE          (TSB_PERI_BASE  + 0x000002C0)  /*!< (PL        ) Base Address */
#define TSB_PM_BASE          (TSB_PERI_BASE  + 0x00000300)  /*!< (PM        ) Base Address */
#define TSB_TB0_BASE         (TSB_PERI_BASE  + 0x00010000)  /*!< (TB0       ) Base Address */
#define TSB_TB1_BASE         (TSB_PERI_BASE  + 0x00010040)  /*!< (TB1       ) Base Address */
#define TSB_TB2_BASE         (TSB_PERI_BASE  + 0x00010080)  /*!< (TB2       ) Base Address */
#define TSB_TB3_BASE         (TSB_PERI_BASE  + 0x000100C0)  /*!< (TB3       ) Base Address */
#define TSB_TB4_BASE         (TSB_PERI_BASE  + 0x00010100)  /*!< (TB4       ) Base Address */
#define TSB_TB5_BASE         (TSB_PERI_BASE  + 0x00010140)  /*!< (TB5       ) Base Address */
#define TSB_TB6_BASE         (TSB_PERI_BASE  + 0x00010180)  /*!< (TB6       ) Base Address */
#define TSB_TB7_BASE         (TSB_PERI_BASE  + 0x000101C0)  /*!< (TB7       ) Base Address */
#define TSB_ENC0_BASE        (TSB_PERI_BASE  + 0x00010400)  /*!< (ENC0      ) Base Address */
#define TSB_ENC1_BASE        (TSB_PERI_BASE  + 0x00010500)  /*!< (ENC1      ) Base Address */
#define TSB_SIO0_BASE        (TSB_PERI_BASE  + 0x00020080)  /*!< (SIO0      ) Base Address */
#define TSB_SIO1_BASE        (TSB_PERI_BASE  + 0x000200C0)  /*!< (SIO1      ) Base Address */
#define TSB_SIO2_BASE        (TSB_PERI_BASE  + 0x00020100)  /*!< (SIO2      ) Base Address */
#define TSB_SIO3_BASE        (TSB_PERI_BASE  + 0x00020140)  /*!< (SIO3      ) Base Address */
#define TSB_ADCA_BASE        (TSB_PERI_BASE  + 0x00030000)  /*!< (ADCA      ) Base Address */
#define TSB_ADCB_BASE        (TSB_PERI_BASE  + 0x00030200)  /*!< (ADCB      ) Base Address */
#define TSB_AMPCMP_BASE      (TSB_PERI_BASE  + 0x00030400)  /*!< (AMPCMP    ) Base Address */
#define TSB_WDT_BASE         (TSB_PERI_BASE  + 0x00040000)  /*!< (WDT       ) Base Address */
#define TSB_CG_BASE          (TSB_PERI_BASE  + 0x00040200)  /*!< (CG        ) Base Address */
#define TSB_OFD_BASE         (TSB_PERI_BASE  + 0x00040800)  /*!< (OFD       ) Base Address */
#define TSB_VD_BASE          (TSB_PERI_BASE  + 0x00040900)  /*!< (VD        ) Base Address */
#define TSB_VE_BASE          (TSB_PERI_BASE  + 0x00050000)  /*!< (VE        ) Base Address */
#define TSB_PMD0_BASE        (TSB_PERI_BASE  + 0x00050400)  /*!< (PMD0      ) Base Address */
#define TSB_PMD1_BASE        (TSB_PERI_BASE  + 0x00050480)  /*!< (PMD1      ) Base Address */
#define TSB_FC_BASE          (TSB_PERI_BASE  + 0x01FFF000)  /*!< (FC        ) Base Address */
/*@}*/ /* end of group TMPM370_MemoryMap */


/******************************************************************************/
/*                            Peripheral Declaration                          */
/******************************************************************************/
/** @addtogroup TMPM370_PeripheralDecl TMPM370 Peripheral Declaration
  @{
*/

#define TSB_PA              ((    TSB_PORT_TypeDef *)       TSB_PA_BASE)
#define TSB_PB              ((    TSB_PORT_TypeDef *)       TSB_PB_BASE)
#define TSB_PC              ((    TSB_PORT_TypeDef *)       TSB_PC_BASE)
#define TSB_PD              ((    TSB_PORT_TypeDef *)       TSB_PD_BASE)
#define TSB_PE              ((    TSB_PORT_TypeDef *)       TSB_PE_BASE)
#define TSB_PF              ((    TSB_PORT_TypeDef *)       TSB_PF_BASE)
#define TSB_PG              ((    TSB_PORT_TypeDef *)       TSB_PG_BASE)
#define TSB_PH              ((    TSB_PORT_TypeDef *)       TSB_PH_BASE)
#define TSB_PI              ((    TSB_PORT_TypeDef *)       TSB_PI_BASE)
#define TSB_PJ              ((    TSB_PORT_TypeDef *)       TSB_PJ_BASE)
#define TSB_PK              ((    TSB_PORT_TypeDef *)       TSB_PK_BASE)
#define TSB_PL              ((    TSB_PORT_TypeDef *)       TSB_PL_BASE)
#define TSB_PM              ((    TSB_PORT_TypeDef *)       TSB_PM_BASE)
#define TSB_TB0             ((    TSB_TMRB_TypeDef *)      TSB_TB0_BASE)
#define TSB_TB1             ((    TSB_TMRB_TypeDef *)      TSB_TB1_BASE)
#define TSB_TB2             ((    TSB_TMRB_TypeDef *)      TSB_TB2_BASE)
#define TSB_TB3             ((    TSB_TMRB_TypeDef *)      TSB_TB3_BASE)
#define TSB_TB4             ((    TSB_TMRB_TypeDef *)      TSB_TB4_BASE)
#define TSB_TB5             ((    TSB_TMRB_TypeDef *)      TSB_TB5_BASE)
#define TSB_TB6             ((    TSB_TMRB_TypeDef *)      TSB_TB6_BASE)
#define TSB_TB7             ((    TSB_TMRB_TypeDef *)      TSB_TB7_BASE)
#define TSB_ENC0            ((     TSB_ENC_TypeDef *)     TSB_ENC0_BASE)
#define TSB_ENC1            ((     TSB_ENC_TypeDef *)     TSB_ENC1_BASE)
#define TSB_SIO0            ((     TSB_SIO_TypeDef *)     TSB_SIO0_BASE)
#define TSB_SIO1            ((     TSB_SIO_TypeDef *)     TSB_SIO1_BASE)
#define TSB_SIO2            ((     TSB_SIO_TypeDef *)     TSB_SIO2_BASE)
#define TSB_SIO3            ((     TSB_SIO_TypeDef *)     TSB_SIO3_BASE)
#define TSB_ADCA            ((     TSB_ADC_TypeDef *)     TSB_ADCA_BASE)
#define TSB_ADCB            ((     TSB_ADC_TypeDef *)     TSB_ADCB_BASE)
#define TSB_AMPCMP          ((  TSB_AMPCMP_TypeDef *)   TSB_AMPCMP_BASE)
#define TSB_WDT             ((     TSB_WDT_TypeDef *)      TSB_WDT_BASE)
#define TSB_CG              ((      TSB_CG_TypeDef *)       TSB_CG_BASE)
#define TSB_OFD             ((     TSB_OFD_TypeDef *)      TSB_OFD_BASE)
#define TSB_VD              ((      TSB_VD_TypeDef *)       TSB_VD_BASE)
#define TSB_VE              ((      TSB_VE_TypeDef *)       TSB_VE_BASE)
#define TSB_PMD0            ((     TSB_PMD_TypeDef *)     TSB_PMD0_BASE)
#define TSB_PMD0            ((     TSB_PMD_TypeDef *)     TSB_PMD0_BASE)
#define TSB_FC              ((      TSB_FC_TypeDef *)       TSB_FC_BASE)
/*@}*/ /* end of group TMPM370_PeripheralDecl */

/*@}*/ /* end of group TMPM370_Definitions */

#ifdef __cplusplus
}
#endif

#endif  /* __TMPM370_H__ */
